# RbsElecAmbientTemperature Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsElecAmbientTemperature Property
ParameterTypeId Class See Also
---
"Ambient Temperature"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsElecAmbientTemperature { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsElecAmbientTemperature As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsElecAmbientTemperature {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace